/*
 Navicat Premium Data Transfer

 Source Server         : root
 Source Server Type    : MySQL
 Source Server Version : 50735
 Source Host           : localhost:3306
 Source Schema         : volunteerdb

 Target Server Type    : MySQL
 Target Server Version : 50735
 File Encoding         : 65001

 Date: 21/05/2023 20:52:16
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for t_activity_info
-- ----------------------------
DROP TABLE IF EXISTS `t_activity_info`;
CREATE TABLE `t_activity_info`  (
  `ACTIVITY_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '志愿活动id',
  `ACTIVITY_TITLE` varchar(150) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动标题',
  `ACTIVITY_CONTINUE` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动活动时间（开始时间 - 结束时间）',
  `ACTIVITY_LIMIT` tinyint(4) NOT NULL COMMENT '志愿活动参与人数限制',
  `ACTIVITY_CLASSIC` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动分类',
  `ACTIVITY_PUBLIC` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动发布时间',
  `ACTIVITY_BANNER` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动banner图地址',
  `ACTIVITY_PLACE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动地点',
  `ACTIVITY_SIMPLE` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动内容简介',
  `ACTIVITY_CONTENT` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动内容',
  `ACTIVITY_REQUIRE` varchar(400) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动报名要求',
  `ACTIVITY_CONTACT` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动负责人姓名',
  `ACTIVITY_PHONE` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动负责人电话',
  `ACTIVITY_CUTOFF` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿活动报名截止时间',
  `ACTIVITY_SHOW` tinyint(4) NOT NULL DEFAULT 0 COMMENT '管理员决定志愿活动是否显示（0-不显示 1-显示）',
  `FK_ACTIVITY_PUBLISHER` int(11) NOT NULL COMMENT '志愿活动发布单位',
  PRIMARY KEY (`ACTIVITY_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 7 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '志愿活动信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_activity_info
-- ----------------------------
INSERT INTO `t_activity_info` VALUES (1, '深入各自包抓街道、巷道及小区,开展“牛皮癣”清理志愿服务活动', '2022-08-21 00:00:00 至 2022-08-22 00:00:00', 10, '便民服务', '2022-08-19 16:29:04', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/20220819162900.jpg', '四川省成都市金堂县XX大街23号', '深入各自包抓街道、巷道及小区,开展“牛皮癣”清理志愿服务活动', '深入各自包抓街道、巷道及小区,开展“牛皮癣”清理志愿服务活动', '无要求', '金芳', '13399382169 ', '2022-08-20 12:00:00', 1, 2);
INSERT INTO `t_activity_info` VALUES (2, '讲好广州故事，助力红色精彩', '2022-09-21 00:00:00 至 2022-09-22 00:00:00', 30, '文明实践', '2022-09-27 22:10:25', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/20220927221018.jpg', '广东省广州市越秀区团一大地铁站A出口', '讲好广州故事，助力红色精彩。', '讲好广州故事，助力红色精彩。中国社会主义青年团（中国共产主义青年团前身）第一次全国代表大会旧址，“团一大”被称为中国青年运动发展史上的伟大里程碑，重走广州的经典红色路线，感受街巷里的红色印记。', '1、疫情防控需求，绿码才能参加，每组不能超过15人。 2、志愿者报名前，请阅读活动帖报名步骤。此次活动为热心大学生组织的公益活动，活动帖仅为报名邀约，非服务承诺，请志愿者评估并认为适合自己后再报名，活动变更信息以活动群通知为准，不再电话通知。不便之处敬请谅解 3、学生统一穿着校服，报名前请仔细阅读活动内容和备注条件，量力而行，服务社会，让我们在正佳志愿中学会做人，学会做事！ 4、严格执行团委规定，必须现场签到，现场签退，并在服务记录确认是否签退成功。', '梁老师/杨老师', '13802523564', '2022-09-19 00:00:00', 1, 2);
INSERT INTO `t_activity_info` VALUES (3, '县政府办志愿者去永丰花园A区开展全员核酸志愿服务', '2022-09-14 00:00:00 至 2022-09-15 00:00:00', 10, '志愿防疫', '2022-09-27 22:12:26', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultBanner1.png', '四川省阿坝藏族羌族自治州九寨沟县', '帮助进行核酸检测', '县政府办志愿者去永丰花园A区开展全员核酸志愿服务', '无要求', '曾艳', '18990423388 ', '2022-09-13 00:00:00', 1, 2);
INSERT INTO `t_activity_info` VALUES (4, '党校联系村四寨村核酸检测志愿服务', '2022-09-29 00:00:00 至 2022-09-30 00:00:00', 12, '志愿防疫', '2022-09-27 22:29:07', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultBanner1.png', '四川省阿坝藏族羌族自治州小金县', '党校联系村四寨村核酸检测志愿服务', '党校联系村四寨村核酸检测志愿服务', '无要求', '何昌燕', '18990423884 ', '2022-09-28 21:00:00', 1, 10);
INSERT INTO `t_activity_info` VALUES (5, ' 法律普及', '2022-10-03 00:00:00 至 2022-10-05 00:00:00', 5, '便民服务', '2022-09-27 22:32:27', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/20220927223225.jpg', '河北省邢台市巨鹿县新华北街101号', '法律普及', '向社区妇女群众宣传《民法典》的重要意义。', '懂得一些法律知识', '左晓爽', '13874932780', '2022-10-02 00:00:00', 1, 10);
INSERT INTO `t_activity_info` VALUES (6, '9月28日网络欺凌项目活动协助', '2022-09-29 00:00:00 至 2022-09-30 00:00:00', 20, '青少年服务', '2022-09-27 22:36:49', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/20220927223647.jpg', '广东省佛山市顺德区容桂街道胡锦超职业技术学校', '胡锦超职业技术学校网络欺凌活动项目小组将于9月28日下午进行网络欺凌项目活动的宣传视频录制，届时需要', '2022年9月28日下午胡锦超职业技术学校网络欺凌活动项目小组将进行网络欺凌项目活动的宣传视频录制，志愿服务时间为：9月28日16：00-21:00，届时需要15名本校学生志愿者协助活动搬运物资、视频拍摄、后期剪辑等志愿服务。', '已通过微信报名的志愿者才可报名本i志愿活动', '李颖', '18318898361', '2022-09-28 22:00:00', 1, 2);

-- ----------------------------
-- Table structure for t_admin_info
-- ----------------------------
DROP TABLE IF EXISTS `t_admin_info`;
CREATE TABLE `t_admin_info`  (
  `ADMIN_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '管理员id',
  `ADMIN_NAME` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '管理员名字',
  `ADMIN_PASSWORD` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '管理员密码',
  `ADMIN_AVATAR` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '管理员头像地址',
  `ADMIN_PHONE` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '管理员手机号',
  `ADMIN_EMAIL` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '管理员邮箱',
  `ADMIN_TYPE` tinyint(4) NOT NULL DEFAULT 3 COMMENT '管理员身份标识',
  PRIMARY KEY (`ADMIN_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '管理员信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_admin_info
-- ----------------------------
INSERT INTO `t_admin_info` VALUES (1, '系统管理员', '12345', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/blog/image/avatar.jpg', '17284313663', '18321779@qq.com', 3);

-- ----------------------------
-- Table structure for t_apply_info
-- ----------------------------
DROP TABLE IF EXISTS `t_apply_info`;
CREATE TABLE `t_apply_info`  (
  `APPLY_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '申请信息id',
  `APPLY_TITLE` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '申请信息标题',
  `APPLY_DESCRIPTION` varchar(500) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '申请信息描述',
  `APPLY_TIME` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '申请时间',
  `APPLY_TYPE` tinyint(4) NOT NULL COMMENT '申请类型（0-申请参加活动 1-申请加入团队 2-发布志愿活动 3-志愿者团队注册 4-志愿单位注册）',
  `APPLY_STATUS` tinyint(4) NOT NULL DEFAULT 0 COMMENT '申请信息状态（0-待审核 1-审核通过 2-审核未通过）',
  `APPLY_AUDITTIME` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '申请信息被审核的时间',
  `FK_APPLICANT_ID` int(11) NOT NULL COMMENT '申请方id（若是参加活动申请或加入志愿者团队申请，则该列为志愿者id；若是发布志愿活动申请，则该列为志愿活动id；若是志愿单位注册申请，则该列为志愿单位id；若是志愿者团队注册申请，则该列为志愿者团队id）',
  `FK_APPLICANT_TYPE` tinyint(4) NOT NULL COMMENT '申请方类型（0-志愿者、1-志愿者团队，2-志愿单位，3-志愿活动）',
  `FK_AUDITOR_ID` int(11) NOT NULL COMMENT '审核该条申请信息的人的id（若是参加活动申请，则该列为志愿单位id；若是加入志愿团队申请，则该列为志愿者团队id；若是发布志愿活动、志愿者团队注册、志愿单位注册申请，则该列为管理员id）',
  `FK_AUDITOR_TYPE` tinyint(4) NOT NULL COMMENT '审核该条申请信息的人的类型（1-志愿者团队，2-志愿单位，3-管理员）',
  `FK_APPLIED_ACTIVITY` int(11) NULL DEFAULT NULL COMMENT '只在志愿者申请参加活动和志愿单位发布活动时使用该字段，主要用于存储被申请的志愿活动id，以及后续判断一个志愿者是否已申请一个志愿活动',
  PRIMARY KEY (`APPLY_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 13 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '申请信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_apply_info
-- ----------------------------
INSERT INTO `t_apply_info` VALUES (1, '发布志愿活动', '发布志愿活动', '2022-08-19 16:29:05', 2, 1, '2022-08-19 16:55:14', 2, 2, 1, 3, 1);
INSERT INTO `t_apply_info` VALUES (2, '申请参加活动', '你好，我想参加本次的志愿活动，希望能给个机会', '2022-08-19 19:37:24', 0, 1, '2022-08-19 19:40:27', 9, 0, 2, 2, 1);
INSERT INTO `t_apply_info` VALUES (3, '申请加入团队', '你好，我想加入贵团队一起做志愿活动，希望能给个机会', '2022-08-19 20:32:50', 1, 2, '2022-08-19 20:34:49', 9, 0, 3, 1, NULL);
INSERT INTO `t_apply_info` VALUES (4, '申请加入团队', '你好，我对贵团队颇有兴趣，还望给个机会让我加入到团队中，大家一起奋斗', '2022-08-19 20:37:01', 1, 1, '2022-08-19 20:38:03', 9, 0, 2, 1, NULL);
INSERT INTO `t_apply_info` VALUES (6, '志愿者团队注册', '志愿者团队注册', '2022-08-25 16:20:13', 3, 1, '2022-08-25 17:41:02', 12, 1, 1, 3, NULL);
INSERT INTO `t_apply_info` VALUES (7, '申请加团队', '你好，我想加入你们团队，可以吗', '2022-09-27 22:03:52', 1, 1, '2022-09-28 13:25:48', 9, 0, 2, 1, NULL);
INSERT INTO `t_apply_info` VALUES (8, '发布志愿活动', '发布新的志愿活动，请审核', '2022-09-27 22:10:25', 2, 1, '2022-09-27 22:10:25', 2, 2, 1, 3, 2);
INSERT INTO `t_apply_info` VALUES (9, '发布志愿活动', '发布新的志愿活动，请审核', '2022-09-27 22:12:26', 2, 1, '2022-09-27 22:12:26', 2, 2, 1, 3, 3);
INSERT INTO `t_apply_info` VALUES (10, '发布志愿活动', '发布新的志愿活动，请审核', '2022-09-27 22:29:07', 2, 1, '2022-09-27 22:33:22', 10, 2, 1, 3, 4);
INSERT INTO `t_apply_info` VALUES (11, '发布志愿活动', '发布新的志愿活动，请审核', '2022-09-27 22:32:27', 2, 1, '2022-09-27 22:33:17', 10, 2, 1, 3, 5);
INSERT INTO `t_apply_info` VALUES (12, '发布志愿活动', '发布新的志愿活动，请审核', '2022-09-27 22:36:49', 2, 1, '2022-09-28 13:24:41', 2, 2, 1, 3, 6);

-- ----------------------------
-- Table structure for t_donate_info
-- ----------------------------
DROP TABLE IF EXISTS `t_donate_info`;
CREATE TABLE `t_donate_info`  (
  `DONATE_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '捐赠信息id',
  `DONATE_AMOUNT` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '捐赠金额',
  `FK_DONATE_USER` int(255) NOT NULL COMMENT '捐赠用户',
  `FK_DONATE_USERTYPE` int(255) NOT NULL COMMENT '捐赠用户类型',
  `DONATE_DATE` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '捐赠时间',
  PRIMARY KEY (`DONATE_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '捐赠记录信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_donate_info
-- ----------------------------
INSERT INTO `t_donate_info` VALUES (1, '5.00', 9, 0, '2022-09-27 21:40:31');
INSERT INTO `t_donate_info` VALUES (2, '100.00', 9, 0, '2022-09-27 21:46:11');
INSERT INTO `t_donate_info` VALUES (3, '10.00', 9, 0, '2022-12-30 16:08:06');

-- ----------------------------
-- Table structure for t_inform_info
-- ----------------------------
DROP TABLE IF EXISTS `t_inform_info`;
CREATE TABLE `t_inform_info`  (
  `INFORM_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '资讯主键id',
  `INFORM_TITLE` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '资讯标题',
  `INFORM_PUBLIC` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '资讯发布时间',
  `INFORM_CONTENT` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '资讯文章内容',
  `INFORM_FROM` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '资讯来源',
  `INFORM_VIEW` int(11) NOT NULL DEFAULT 0 COMMENT '资讯被点击查看次数',
  `INFORM_STATUS` tinyint(4) NOT NULL DEFAULT 1 COMMENT '咨询状态 0-不显示 1-显示',
  PRIMARY KEY (`INFORM_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 11 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '志愿资讯信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_inform_info
-- ----------------------------
INSERT INTO `t_inform_info` VALUES (2, '北京：发布新冠肺炎疫情社区防控志愿服务工作指引', '2022-06-14', '　　本报讯 (记者 安 娜) 为进一步动员志愿服务组织和志愿者科学有序参与社区疫情防控，北京市委社会工委市民政局日前会同首都文明办、团市委、市志愿服务联合会制定《北京市新冠肺炎疫情社区防控志愿服务工作指引》(以下简称《指引》)。\n\n　　《指引》指出，社区疫情防控志愿服务内容有核酸检测、社区值守、物资配送、信息管理等。依据志愿者参与流程，社区疫情防控志愿服务可分为三个阶段。首先，在志愿者上岗服务前做好志愿服务计划和动员工作。社区可以依据疫情防控要求进行志愿服务的总体规划，将具体工作任务进行细分，结合社区居民需求和工作要求开发志愿服务岗位，广泛动员社会力量和社区居民参与疫情防控。其次，在志愿服务开展过程中做好志愿者的服务管理工作。社区为志愿者开展岗前培训，提供志愿者安全防护和必要保障，做好志愿者的引导与管理。再次，在志愿服务活动结束后及时进行志愿服务成果转化，总结推广志愿服务成功经验，宣传志愿服务先进典型，营造良好社会氛围。\n\n　　根据疫情和防控形势，北京市划分了疫情防控封控区、管控区和防范区，《指引》建议，处于不同类型区域的社区在使用、安排志愿者工作时有所侧重。封控区实行“区域封闭、足不出户、服务上门”，建议根据社区需要调配志愿者参与物资配送、防疫消杀等工作，协助社区为老、弱、病、残、孕等群体提供帮助。管控区实行“人不出区、严禁聚集”，建议根据社区需要调配志愿者参与社区值守、核酸检测、协同流调和信息管理等服务，协助社区帮助困难群体开展邻里互助。防范区实行“强化社会面管控，严格限制人员聚集”，建议社区充分储备各类志愿者，建立联络机制，在情况紧急时能招募到足够的志愿者协助社区开展疫情防控工作。', '中国社会报', 210, 1);
INSERT INTO `t_inform_info` VALUES (3, '山西：省文明办、省民政厅等向全省广大志愿者发出倡议书', '2022-08-28', '亲爱的志愿者朋友们：\n\n　　当前我省同时段多地发生输入性局部疫情，外防输入压力巨大，内防反弹任务繁重，疫情防控仍处于最关键、最吃劲的阶段。习近平总书记强调，要打赢疫情防控这场人民战争，必须紧紧依靠人民群众，要发挥社会工作的专业优势，支持广大社工、义工和志愿者开展心理疏导、情绪支持、保障支持等服务。\n  \n　　自疫情发生以来，全省志愿者就迅速投入到这场没有硝烟的“阻击战”中，在社区街道入户登记、在街头巷尾消毒灭菌、在交通要道摸排测温、在密集场所科普宣传......到处都闪现着“红马甲”的身影。他们不畏疫情、无私奉献，受到了全社会的高度赞扬，完美诠释了“奉献、友爱、互助、进步”的志愿精神。但疫情还未过去，还需要我们众志成城、携手共进，才能彻底打赢这场疫情防控的人民战争。新时代文明实践中心（所、站）要发挥好自身优势，团结和引导广大志愿者积极投入到疫情防控工作中去。在此，就全省广大志愿者开展疫情防控服务作出以下几点温馨提示：\n\n　　一、以身作则，展现良好形象。\n\n　　全省广大志愿者要充分学习掌握疫情防护相关知识，带头遵守疫情防控各项规定，传递社会正能量，当好疫情防控的宣传员、公共防护的劝导员、亲情传递的联络员，不信谣、不传谣，不因个人行为造成负面消息的传播，同时密切关注身体健康状况，自觉按照科学指引做好个人防护。\n\n　　二、听从指挥，发挥更大作用。\n\n　　全省广大志愿者要在当地疫情防控指挥领导小组、有关部门和志愿服务组织的统一指挥和统筹协调下，在具备良好防护措施的前提下，充分发挥自身专业优势参与防控相关工作。鼓励广大志愿者积极协助社区、街道开展信息收集报告、小区居民日常生活服务、防疫知识宣传等非接触性志愿服务，特别是要关心关爱有需要的妇女儿童、老年人、残疾人、优抚对象、低保对象等困难群体，帮助他们顺利渡过难关。\n\n　　三、分类施策，提供精准关爱。\n\n　　全省广大志愿者要有效利用新媒体手段，为有需要的人群和团队分类提供心理咨询、课业辅导、技术支持等线上服务。尤其要为战斗在抗疫一线的医疗工作者及其家属，为接受治疗的患者及其家属，为处在医学观察期或居家隔离的人们提供心理疏导和慰藉服务，帮助他们保持健康、积极的心态，为他们解决后顾之忧，共同赢得战“疫”的最终胜利。\n\n　　四、文明有序，提供专业服务。\n\n　　按照当地疫情防控工作的整体部署，根据实际需求组织辖区志愿者做好相应培训和保护措施，立足本地，结合所长，成立应急救援、医疗卫生、科普应急、心理疏导等应急志愿服务队，就近就便参加志愿服务，做好疫情防控辅助工作。\n\n　　全省广大志愿者们，在疫情面前你们是挺身而出的勇士、是隐姓埋名的英雄、是新时代文明的先锋，让我们在省委、省政府的坚强领导下，携起手来，筑牢阵地，万众一心，积极投入到疫情防控志愿服务中，为坚决遏制疫情传播扩散，夺取疫情防控斗争全面胜利贡献志愿服务力量！', '山西省文明办', 245, 1);
INSERT INTO `t_inform_info` VALUES (4, '广东：民政厅印发关于发挥“五社联动”作用助力基层疫情防控工作的通知', '2022-09-12', '各地级以上市民政局：\n\n　　近期，我省新冠疫情散点多发，形势复杂严峻，基层疫情防控工作压力大、任务重。为深入学习贯彻习近平总书记关于疫情防控工作的重要讲话指示精神，全面落实党中央、国务院关于加强疫情防控各项决策部署及省委、省政府有关工作要求，积极发挥以社区为平台、社会组织为载体、社会工作者为支撑、社区志愿者为辅助、社会慈善资源为补充的“五社联动”工作机制的作用，助力基层疫情防控工作，现就有关事项通知如下：\n\n　　一、工作重点\n\n　　（一）发挥社区的制度优势。完善村（社区）卫生服务机构和公共卫生委员会协调联动工作机制，引导社区在疫情发生时根据基层党委和政府统一调度做好应急响应、处置，协助协调配合做好人员摸排、小区封闭封控管理、居家隔离对象监督管理、群众生活和健康需求服务保障、疫情防控政策宣传等工作。充分发挥党领导下充满活力的基层群众自治制度优势，建立健全村（社区）组织动员体系，整合村（社区）党群服务中心、卫生服务站（室、中心）、物业服务企业、辖区单位等资源，调动党员、村（居）民小组长、村（居）民代表、楼（栋、单元）长、志愿者等共同做好防控工作。协助做好村（社区）老年人、未成年人、残疾人、困难家庭成员等重点人群健康服务。\n\n　　（二）发挥社会组织的资源优势。积极引导社会组织特别是社区社会组织，在村（社区）统筹协调下，充分发挥密切联系群众的优势，有序参与疫情防控工作。各类社会组织要发挥行业性、专业性强的优势，精准对接，靠前服务，积极开展捐赠活动，鼓励组建志愿服务队协助村（社区）开展疫情工作，及时了解会员单位困难和需求，积极为会员单位排忧解难；社区社会组织要积极协助村（社区）开展全员核酸检测、社区宣传、关爱困难群众等联防联控工作；社会服务机构要切实加强对服务对象的管理，严格落实属地疫情防控措施和行业部门工作指引，压紧压实管理责任，确保服务对象人身安全。各类社会组织要严格落实《广东省社会组织管理局关于从严从紧强化社会组织疫情防控工作的通知》要求，切实提高政治站位，严格控制人员聚集性活动，从严从紧强化疫情防控工作，为打赢疫情防控硬仗贡献力量。\n\n　　（三）发挥社会工作者的专业优势。支持“双百”社工发挥熟悉村（社区）、群众信任的优势，引导社工服务机构社工下沉村（社区），共同运用社会工作专业理念、方法和技巧，加大对受疫情影响特殊困难群体的摸排力度，多渠道掌握物质、心理、社会等方面需求。将特殊困难群体作为重点服务对象，特别是对生活困难的确诊患者、受疫情影响在家隔离的孤寡老人和因家人被隔离收治而无人照料的老年人、残疾人、未成年人，以及社会散居孤儿、留守老人、留守儿童等特殊群体，做到早发现、早介入、早救助，积极协助落实有关政策，广泛链接社会资源，及时提供个性化、专业化服务，帮助他们排忧解难、增能赋权，兜住底、兜准底、兜好底。发动居民群众积极参与社区疫情防控，协调社区社会组织、社区公益慈善等多方资源，联动志愿者为村（社区）内居家隔离人员、其他重点照护人群和一线抗疫人员提供物质支持。通过开通心理服务热线、建立心理咨询线下服务点等方式，为居家和集中隔离人员及家属、严重焦虑者、心理压力较大的一线抗疫人员和有需求的居民群众提供危机干预、情绪疏导、人文关怀等心理支持。\n\n　　（四）发挥社区志愿者的人力优势。引导广大志愿者按照“就近就便”原则，立足实际、各尽所能、各展所长，在严格做好个人防护的前提下，听从村（社区）统一指挥，协助做好疫情防控排查、扫码登记、疫情防控知识宣传、核酸检测点秩序维护、咨询引导、帮助弱势群体等志愿服务工作，共同维护社会公共秩序。鼓励有医学、心理、应急救援等专业技能的志愿者，在村（社区）和相关专业机构的统筹调配下，积极参与疫情防控辅助工作。对家有老人和孩子需要照顾或有家庭困难的一线抗疫人员，积极提供陪护就医、生活照料、课业辅导、物资代购、家居清洁等志愿服务。\n\n　　（五）发挥社会慈善资源的资金优势。倡导广大爱心企业和社会各界爱心人士积极捐款捐物，推动社会慈善资源向村（社区）下沉，增强社区慈善力量。引导慈善组织根据实际情况开展防疫关爱项目、设立抗疫专项基金、依法依规开展募捐，筹集用于疫情防控的资金和物资。加强对疫情防控社会捐赠工作指导，督促慈善组织按照“依法、精准、高效、公开”的原则，依据《慈善法》《慈善组织公开募捐管理办法》等有关规定，做好公开募捐、受益人确定、协议签订、财产管理使用、信息公开等方面工作。加强与慈善组织之间的信息沟通、密切协作，做好社会慈善资源供需有序对接，促进社会慈善资源合理配置、高效服务。建立健全监督机制，畅通监督渠道，监督慈善组织及时向社会公布捐赠款物接收分配情况，做到信息长期可查询，接受捐赠人和社会的监督。\n\n　　二、保障措施\n\n　　（一）建立组织协调机制。各地民政部门要提高站位，切实增强做好疫情防控工作的紧迫感、使命感，将“五社联动”作为民政部门助力基层疫情防控、守住民政领域疫情防控“两条底线”的重要抓手。要建立由局领导牵头统筹，基层政权建设和社区治理、慈善事业促进和社会工作、社会组织管理等机构参与的组织协调机制，定期召开会议，分析研究形势，制定推进措施，确保各项工作落实落细落到位。\n\n　　（二）建立信息共享机制。各地民政部门要建立信息共享机制，进一步强化统筹协调，发挥社会工作者、志愿者扎根村（社区）、贴近群众的优势，及时收集、整理、汇总群众的需求，认真梳理社区、社会组织、社会工作服务站（机构）、社区志愿者、社会慈善资源等资源供给，通过工作联议、项目联作等方式实现需求与供给的高效匹配，形成“五社联动”工作合力，做到信息共享、资源共用、优势互补。\n\n　　（三）建立个人防护机制。参加疫情防控的社区工作者、社会工作者和志愿者要全面落实省、市、县疫情防控指挥部的要求，严格落实戴口罩、消毒、疫苗接种、核酸检测、扫码测温等防控措施，必须在保证自身安全的情况下方可参与村（社区）抗疫，坚决杜绝因参与疫情防控被感染现象发生。如有接触确诊病例、密接者等，需按防疫规定隔离观察，解除隔离观察方可返回工作岗位。社会工作者和志愿者原则上不跨区域服务，在面对情况复杂、专业力量薄弱、工作量大的地区需要协同服务时，由当地疫情防控指挥部进行统一调配。\n\n　　（四）建立关心关爱机制。各地民政部门要指导村（社区）、社会工作服务站（机构）、志愿服务组织、社会组织等按照“谁组织、谁保护”的原则，通过提供安全防护培训、防疫物资、购买人身保险、督导培训等方式加强社区工作者、社会工作者、社区志愿者、社会组织工作人员等个人防护，建立健全信息报告、应急处置、安全防护、人员激励等制度。同时，鼓励采取增加补贴、政策倾斜、强化保障、关爱帮扶、褒扬表彰等举措，切实加强相关人员的保护和关心。', '广东省民政厅', 2350, 1);
INSERT INTO `t_inform_info` VALUES (5, '河南郑州： 创新机制 加快推进志愿服务工作发展', '2022-10-11', '　　近年来，河南省郑州市不断完善志愿服务政策体系，创新工作机制，以贯彻落实《志愿服务条例》为抓手，加快推进志愿服务工作发展，截至2022年初，全市注册志愿者234万余人，志愿服务队伍1万余支，取得良好成效。\n\n　　一是注重规划引领，完善志愿服务政策创制。 一方面完善政策创制。市民政部门积极协同组织部、宣传部、文明办等相关部门，先后出台了《关于支持和发展志愿服务组织的实施意见》《社会工作者与志愿者联动实施办法》等政策文件，建立健全志愿服务招募、注册、培训、激励等工作机制，做好志愿服务记录和证明出具监督管理，为志愿服务工作规范化发展提供有力支持。另一方面营造良好氛围。每年举办学雷锋纪念日和国际志愿者日宣传活动，深入学习宣传国务院《志愿服务条例》《河南省志愿服务条例》以及相关政策法规。\n\n　　二是健全志愿服务工作机制，积极应对水灾、疫情重大突发事件。 在面对“7·20”特大暴雨灾害和反复反弹的疫情中，郑州市通过完善协调合作机制、完善志愿服务指南、建立多支专业志愿服务队伍、建立畅通信息沟通机制等举措，调动志愿者、志愿服务组织参与应对重大突发事件，充分发挥其在社会治理中的积极作用。“7·20”特大暴雨和疫情发生后，郑州市动员专业社工7000余人次、志愿者40多万人次参与到重大突发事件中，调查需求，链接救援物资，做好特殊群体困难群众入户探访、资源链接、秩序维护等工作，发挥专业社工、志愿者联动的积极作用，为打赢防汛救灾和疫情防控阻击战做出了积极贡献。\n\n　　三是注重素质提升，规范志愿服务队伍发展。 一方面强化培训，培养志愿服务骨干。建立健全郑州市骨干志愿者培训联盟体系，组织开展骨干志愿者培训会、培训工作坊200余场，累计培训骨干志愿者50余万人次，辐射受益志愿者逾100万人次，通过互动讨论，交流经验、培育志愿服务组织、项目管理等内容，提高志愿者服务能力。另一方面打造平台，孵化培育志愿服务项目。郑州市建成省内首个市级社会工作孵化培育暨社会创新发展基地，将志愿服务组织及项目纳入培育孵化范围，通过实务分享、实地参访、座谈交流、集体督导等形式，培育公益项目，培养志愿服务骨干，孵化成效明显。\n\n　　四是加强监督管理，履行志愿服务行政职能。 一方面优化环境，强化志愿服务组织监管。切实履行志愿服务行政管理职责，严格开展志愿服务组织摸底排查，发布《郑州市民政局关于做好疫情期间志愿服务行政管理的通知》，对全市志愿服务活动进行全面排查，对于群众举报的志愿服务活动涉嫌违法违规等情况，及时调查核实、及时进行查处。同时，发布《关于对违法违规志愿服务行为开展投诉举报的公告》，明确志愿服务违法违规投诉举报内容，畅通投诉举报渠道。另一方面强化保障，在全市推广全国志愿服务信息系统，持续推进志愿服务信息数据归集和管理。同时，做好相关培训和摸查工作，发现非法志愿服务团队、志愿服务活动及时处置，保证系统的有效使用。\n', '《中国民政》杂志2022年第4期', 152, 1);
INSERT INTO `t_inform_info` VALUES (6, '湖北： 以“五社联动”项目为抓手 促进志愿服务创新发展', '2022-07-08', '　　近年来，湖北省坚持以社区为平台、以社会组织为载体、以社工人才为支撑，链接慈善资源，实施“五社联动”项目，推动志愿服务项目化、组织化、常态化，促进志愿服务有效融入社区治理，助力提升基层社会治理能力和水平。\n\n　　一是创新“五社联动”机制，推动志愿服务突破性发展。 新冠肺炎疫情发生以来，湖北120多万名志愿者无私奉献，投身抗疫一线，参与疫情防控，协助社区开展核酸检测、人员排查、防疫知识宣传等志愿服务，涌现出了“最美90后教师”华雨辰、“快递小哥”汪勇等一批优秀志愿者，为武汉保卫战、湖北保卫战取得决定性胜利作出了积极贡献。在民政部的大力支持下，全省链接慈善组织资金8300万元，依托社工机构和社工专业人才实施“五社联动”项目，探索建立“五社联动”机制，助力推动社工服务与志愿服务融合发展，培育社区志愿服务组织，壮大社区志愿服务队伍。截至目前，第一阶段项目覆盖武汉市87个社区、其它市州123个乡镇（街道），探访康复患者等重点人群6991人，为4410人提供专项心理支持服务，受益人群达156.8万人次。全省及时总结项目实施经验，出台《关于创新“五社联动”机制 提升社区效能的意见》《湖北省城乡社区“五社联动”工作指引》等文件，举办“五社联动”社会工作理论与实务研讨会。截至目前，全省注册志愿者从2020年底的885万人增长到1000万人以上，占全省常住居民人口的17%。\n\n　　二是培育志愿服务组织，推动志愿服务健康有序发展。 省民政厅印发《湖北省培育发展社区社会组织专项行动重点任务》，明确要求加大服务性、公益性、互助性社区社会组织培育发展力度，开展好“邻里守望”系列社区志愿服务活动。依据社会组织登记管理要求，民政部门及时受理志愿服务组织成立申请，严格审查，依法登记。配合业务主管部门，完善志愿服务组织法人治理结构，加强志愿服务组织日常管理。对依法成立的志愿服务组织在社会组织登记管理信息系统中对其进行身份标识。截至目前，全省共有标识的志愿服务组织812家。省级财政预算安排社会服务和社会组织培育引导资金6350万元、基层社会治理补助资金9000万元。\n\n　　三是建立长效机制，推动志愿服务常态化发展。省委、省政府两办出台深化新时代志愿服务工作助力基层社会治理的意见，对推进新时代志愿服务工作作出全面部署。省文明委印发志愿服务激励嘉许办法，完善志愿服务激励嘉许制度。借鉴疫情防控经验，推动在职党员干部下沉社区，全面建立健全“社区点单、党员报到”志愿服务工作机制。全省11129家机关企事业单位对口联系4556家社区，104万名党员干部到居住地社区报到，每个党员都参与社区治理和服务工作，每年从事志愿服务活动的累计时长不少于20小时。全省各级民政部门持续开展社区公益创投活动，通过公益项目引导居民参与社区志愿服务。省民政厅连续7年举办全省公益创投大赛，累计举办15期培训班，创意策划3000多个公益项目。', '《中国民政》杂志2022年第4期', 3462, 1);
INSERT INTO `t_inform_info` VALUES (7, '山东：《山东省志愿服务条例》下月起施行', '2022-10-25', '　　12月3日，《山东省志愿服务条例》已经山东省十三届人大常委会第三十二次会议审议通过，将于2022年1月1日起施行。对有良好志愿服务记录的志愿者，县级以上人民政府和有关部门、单位可以在健康保健体检、游览旅游景点、乘坐公共交通工具等方面给予减费、免费等优惠。另外，公务员考录、事业单位招聘可以依法将志愿服务情况纳入考察内容。\n\n　　![image-20221228200049](http://chinavolunteer.mca.gov.cn/NVSIDF/LEAP/Download/default/2021/12/20/91de0207169f4f1e8b8a9109044b1196.jpeg)\n\n　　良好志愿服务记录者\n\n　　体检、游览景点、乘坐公交减免费\n\n　　“这部条例的出台，对于保障志愿者、志愿服务组织、志愿服务对象的合法权益，发展志愿服务事业，培育和践行社会主义核心价值观具有重要意义。”山东省人大常委会法制工作委员会副主任王仲泉告诉齐鲁晚报·齐鲁壹点记者。\n\n　　该条例界定部门职责，形成推动合力，精神文明指导机构建立志愿服务工作协调机制，加强统筹规划、协调指导、督促检查和经验推广。规定民政部门负责志愿服务行政管理工作，并明确县级以上人民政府、乡镇人民政府、街道办事处的相关职责。积极发挥群团组织作用，规定工会、共产主义青年团、妇女联合会等团体应当发挥各自优势，做好相应的志愿服务工作。\n\n　　条例明确志愿者权利义务，规范注册行为，并规定省人民政府民政部门对志愿服务数据的归集、管理责任。加强志愿服务组织的登记管理，并保障志愿服务组织按照章程依法自主开展志愿服务活动的权利。强化对志愿服务活动的规范，规定志愿服务组织在培训、招募等活动中的义务，引导签订志愿服务书面协议。\n\n　　条例明确，对在志愿服务事业发展中做出突出贡献的志愿者、志愿服务组织以及其他单位和个人，由县级以上人民政府或者有关部门按照有关规定予以表彰、奖励。\n\n　　据了解，县级以上精神文明建设指导机构应当会同有关部门建立志愿服务激励回馈制度，在教育培训、就业创业、享受公共服务等方面制定优惠政策。鼓励社区完善志愿服务回馈机制，支持志愿者利用参加志愿服务的工时换取一定的社区服务；志愿服务组织可以通过服务积分、时间储蓄以及会员互助等方式，激励志愿者参与志愿服务活动。\n\n　　条例提出，对有良好志愿服务记录的志愿者，县级以上人民政府和有关部门、单位可以在健康保健体检、游览旅游景点、乘坐公共交通工具等方面给予减费、免费等优惠。有良好志愿服务记录的志愿者认定标准和认定办法，由省人民政府民政部门会同有关部门制定。\n\n　　公务员考录、事业单位招聘\n\n　　可将志愿服务情况纳入考察内容\n\n　　条例提出，省人民政府民政部门应当建立全省统一的志愿服务信用记录制度，将有良好志愿服务记录或者受到表彰、奖励的志愿者和志愿服务组织信息按照有关规定纳入信用记录。\n\n　　据悉，公务员考录、事业单位招聘可以依法将志愿服务情况纳入考察内容。鼓励企业和其他组织在同等条件下优先招用有良好志愿服务记录的志愿者。\n\n　　志愿者因提供志愿服务受伤、致残或者死亡，符合见义勇为人员确认、工伤认定、烈士评定条件的，县级以上人民政府和有关部门应当依照法律、法规的规定及时予以确认、认定、评定，并落实有关待遇。\n\n　　志愿者因提供志愿服务受伤、致残或者死亡，其家庭生活陷入困难的，县级以上人民政府及其有关部门应当依法给予救助，志愿服务发展基金可以给予帮扶。\n\n　　条例明确，鼓励通过购买服务、捐赠、资助等方式支持志愿服务运营管理，强化志愿服务组织的孵化培育，完善保险制度设计，鼓励各类组织为开展志愿服务提供便利。\n\n　　将抓紧研究制定\n\n　　志愿服务激励回馈办法\n\n　　山东省文明办副主任孙文利介绍说，截至目前，山东省注册志愿者达1694万人，注册志愿服务组织10万个，组织实施志愿服务项目33万个。下一步，将抓紧研究制定志愿服务激励回馈办法，推广时间银行、积分兑换、会员互助等经验做法，树立“德者有得”的鲜明导向。\n\n　　孙文利介绍说，下一步将把志愿服务工作的成效作为衡量新时代文明实践中心建设水平的重要标准，推动文明实践志愿服务制度化常态化。大力扶持志愿服务队伍建设，做大做强各级文明实践志愿服务总队，鼓励和支持组建社会专业志愿服务队伍，广泛成立群众身边的志愿服务队伍，切实发挥各级枢纽型志愿服务组织的作用。\n\n　　山东省民政厅副厅长、一级巡视员冯建国表示，下一步民政部门将在充分调研论证基础上，会同有关部门，按照《条例》要求，研究贯彻落实《条例》的配套措施和政策文件，为志愿服务持续健康发展提供支撑。\n\n　　据介绍，民政部门将加快推进志愿服务信息化建设，整合志愿服务相关信息和数据资源，实现志愿服务数据统一归集、统一管理和共享交换，促进“互联网＋志愿服务”深度融合发展。制定志愿服务协议示范文本，明确志愿服务参与者的权利义务，引导志愿者、志愿服务组织、志愿服务工作者按照志愿服务的原则、程序和标准，规范有序开展志愿服务。研究制定有良好志愿服务记录的志愿者认定标准和认定办法，将《条例》规定的志愿服务奖励优待制度落到实处。\n\n　　原标题：山东省志愿服务条例下月起施行，良好服务记录者游览、乘车减免费', '齐鲁晚报·齐鲁壹点', 5645, 1);
INSERT INTO `t_inform_info` VALUES (8, '四川：全省老年志愿服务大会召开，将探索设立老年志愿服务项目基金', '2022-10-29', '　　本报讯 10月13日，四川省老年志愿服务大会在成都市郫都区召开。省民政厅厅长益西达瓦出席大会并讲话。\n\n　　![image-20221228204343](http://chinavolunteer.mca.gov.cn/NVSIDF/LEAP/Download/default/2021/11/3/ef076d067c8e4957ae432ab0bf5633c0.png)\n\n　　记者从会上获悉，截至目前，全省21个市（州）、110个县（市、区）组建成立了老年志愿服务队伍4662个，老年志愿者人数 90.1万人；2020年，全省老年志愿者服务队伍全年开展活动达7000余场次。\n\n　　推进老年志愿服务常态化发展\n\n　　本次会议是我省首次召开的全省性老年志愿服务工作现场会。会议指出，我省60岁及以上人口达到1816.57万人，老龄化形势十分严峻。近年来，我省聚焦积极应对人口老龄化国家战略，大力推进养老服务高质量发展，老年志愿服务五级队伍框架基本建立，志愿服务品牌项目不断涌现，社会参与度不断提高，取得了初步成效。\n\n　　会议强调，下一步，全省各地要紧紧把握脱贫攻坚与乡村振兴战略有机衔接的历史机遇和“十四五”时期积极应对人口老龄化的窗口机遇，突出工作重点，大力推进老年志愿服务常态化发展。\n\n　　要健全齐抓共管的老年志愿服务工作体系，壮大量质并重的老年志愿服务队伍，建立统一规范的老年志愿服务运行机制，打造互联互通的老年志愿服务信息平台，营造向上向善的老年志愿服务良好氛围，进一步理顺政府、市场、社会、家庭职责功能，积极构建具有四川特色的老年志愿服务体系。\n\n　　探索设立老年志愿服务项目基金\n\n　　要拓展老年志愿服务项目资金渠道，探索设立老年志愿服务项目基金，鼓励通过购买、委托、捐赠、资助等方式，支持老年志愿服务项目的开展。健全老年志愿服务激励机制，将优秀老年志愿者和队伍纳入敬老孝老爱老系列活动评选范围，通过“时间银行”“积分制管理”等形式，促进老年志愿服务互助循环可持续发展。加强老年志愿者权益保障，为老年志愿者提供必要的物质保障、教育培训、安全保险、医疗保障等，解除老年志愿者的后顾之忧。\n\n　　会上，眉山市、成都市郫都区、自贡市、射洪市、阿坝州的代表作了交流发言。与会代表实地考察学习了郫都区老年志愿服务队伍孵化、服务现场调度、适老化产品体验、时间银行试点、特色老年志愿综合服务等。 （晚霞报记者 伍亚玲）', '晚霞报', 2357, 1);
INSERT INTO `t_inform_info` VALUES (9, '四川：2021年度“四川省百名优秀志愿者”拟通报表扬名单公示', '2022-11-09', '　　川观新闻记者 吴浩\n\n　　10月18日，记者从省文明办获悉，2021年度“四川省百名优秀志愿者”拟通报表扬名单即日起开始公示。\n\n　　![image-20221228205949](http://chinavolunteer.mca.gov.cn/NVSIDF/LEAP/Download/default/2021/11/3/bc05e353af5d40acac7d6d8f4409b340.jpeg)\n\n　　根据四川省精神文明建设办公室《关于组织开展第九届 “四川志愿·携手圆梦”志愿服务先进典型宣传推选活动的通知》（川文明办〔2021〕33号）要求，9月下旬，活动组委会办公室组织评委开展了先进典型初评工作。经过组织层层推选和评委评审等程序，评选出了2021年度“四川省百名优秀志愿者”拟通报表扬名单。现对名单予以公示，公示时间为10月18日至20日。\n\n　　公示期间，全省广大干部群众如有意见，请通过电话、传真、电子邮箱、书面或面谈的方式，以真实姓名向活动组委会办公室反映。\n\n　　联系电话(传真)：(028)86603781\n\n　　通讯地址：成都市青羊区仁厚街6号\n\n　　邮政编码：610015\n\n　　电子邮箱：zyfwtx2021@163.com\n\n　　2021年度“四川省百名优秀志愿者”\n\n　　建议名单\n\n　　成都市\n\n　　郑 睿（女） 成都市人民检察院知识产权检察工作办公室\n\n　　主任科员\n\n　　徐远隆 成都市彭州市仁爱社会工作服务中心会长\n\n　　朱 福 成都市崇州市青年应急志愿服务队队长\n\n　　何海林 都江堰市熊猫志愿者团队志愿者\n\n　　自贡市\n\n　　刘乾忆 自贡市富顺县小红帽志愿者协会志愿者\n\n　　许冬亮 自贡市级检察院宣传教育部门负责人\n\n　　杨丽萍 （女） 自贡市富顺县壹家社会工作服务中心志愿者\n\n　　周 宏 自贡市沿滩区益心社会工作服务中心主任\n\n　　攀枝花市\n\n　　陈玉华（女） 攀枝花市南山社区“五老”志愿者\n\n　　雷 永 攀枝花市西区河门口社区志愿者\n\n　　李 理 攀枝花市西区总工会职工志愿服务大队\n\n　　副大队长（省总工会同时推荐）\n\n　　刘元琪（女） 攀钢集团攀枝花钢钒制造部志愿服务队志\n\n　　愿者\n\n　　泸州市\n\n　　王世宏 泸州市纳溪区永宁街道打渔山社区志愿者\n\n　　黄 山 泸州老窖集团“众爱”志愿服务支队志愿者\n\n　　李 玲（女） 泸州市圆梦关爱协会支部副书记\n\n　　李国良 泸州市皂角巷社区志愿服务队志愿者\n\n　　德阳市\n\n　　代清瑶（女） 西藏军区政治部文工团中士\n\n　　寇华秀（女） 德阳市中西医结合医院红十字会志愿者\n\n　　唐顺玉（女） 德阳市绵竹爱心互助协会负责人\n\n　　韦 翔 四川凯锐嘉体育发展有限公司总经理\n\n　　绵阳市\n\n　　文正平 绵阳市文正平文化志愿服务队志愿者\n\n　　韩思春（女） 绵阳市涪城区手拉手文化服务中心志愿者\n\n　　徐小双（女） 绵阳市北川启智新公益“羌山云”志愿服务中队志愿者\n\n　　王 旭 绵阳市游仙区新桥镇新桥社区干部\n\n　　广元市\n\n　　贾 莉（女） 广元市剑阁县普安镇小玲珑社区副书记\n\n　　刘 丽（女） 广元市利州区青年志愿者协会副会长\n\n　　杨 军 广元市苍溪红十字聚爱救援大队大队长\n\n　　赵 波 广元市微公益志愿者协会会长\n\n　　遂宁市\n\n　　何金燕（女） 国网四川射洪市供电有限责任公司员工\n\n　　李 琳（女） 遂宁市气象局办公室副主任\n\n　　杨秀才 遂宁市分水镇五老宣讲志愿服务队队长\n\n　　李晓春（女） 遂宁市大英县妇女儿童发展促进会志愿者\n\n　　内江市\n\n　　胡代英（女） 内江市春风青少年服务中心理事长\n\n　　李勇琴（女） 内江市救助站儿童防性侵知识志愿者\n\n　　陈翛然 内江蓝天救援队队长\n\n　　罗诒柳（女） 内江市城市管理行政执法局机关干部\n\n　　乐山市\n\n　　陈 刚 乐山市红十字会志愿服务队四分队志愿者\n\n　　石玉冰（女） 乐山市井研县青年志愿者服务队负责人\n\n　　张忠喜 乐山市峨眉山市人民检察院检察一部干警\n\n　　周泽军 乐山市犍为县下渡中心小学教师\n\n　　南充市\n\n　　徐 霞（女） 国网蓬安县供电公司党建部副主任\n\n　　李 萍（女） 南充市高坪区文化志愿者协会敬老助残部\n\n　　部长\n\n　　李桂武 南充市南部县桐坪镇分水村（原青松村）第一书记\n\n　　刘少虹（女） 南充市仪陇县青年志愿者协会志愿者\n\n　　宜宾市\n\n　　周 杰 宜宾市珙县关爱留守儿童志愿者协会党支\n\n　　书记兼会长\n\n　　陈昱铸 宜宾市南溪区青年志愿者协会会长\n\n　　陶莲德（女） 宜宾市第二人民医院志愿服务大队负责人\n\n　　李渠达 宜宾市青年志愿者培训学院负责人（团省委同时推荐）\n\n　　广安市\n\n　　胡小国 广安市义务工作者联合会前锋分会副会长\n\n　　蒋银林 广安军分区应急营水上搜救排班长\n\n　　王显军 广安市义务工作者联合会第四（华蓥）分会会长\n\n　　李 波 广安市义务工作者联合会志愿者\n\n　　达州市\n\n　　邓茂垚 国网万源市供电公司志愿服务队志愿者\n\n　　李华勇 达州市通川区红十字医院党支副书记\n\n　　苗锋雨 国网达州供电公司“红杜鹃”志愿服务队志愿者\n\n　　郑长安 达州市渠县十四届政协委员会委员\n\n　　巴中市\n\n　　罗 林 巴中市志愿者协会志愿者\n\n　　孙 容（女） 巴中市巴州区第二人民医院分队副队长\n\n　　杨朝华（女） 巴中市巴中公益救援志愿服务队志愿者\n\n　　赵子生 巴中市志愿者协会志愿者\n\n　　雅安市\n\n　　王茂源 雅安市芦山县志愿者协会志愿者\n\n　　周顺莲（女） 雅安市雨城区书香龙溪学雷锋志愿服务队\n\n　　队长\n\n　　田玉莲（女） 雅安市宝兴县心理志愿者协会志愿者\n\n　　舒国康 雅安市芦山县“五老”志愿服务队志愿者\n\n　　眉山市\n\n　　雷泽珍（女） 眉山市东坡区崇礼镇政府畜牧站员工\n\n　　王佳秋（女） 眉山市仁寿县草根妈妈成长教育协会发起人\n\n　　袁福良 眉山市彭山区友仁公益发展协会党支部\n\n　　书记\n\n　　周明弟 眉山市洪雅县 “五老”志愿者\n\n　　资阳市\n\n　　蒋小康 国网资阳市雁江供电公司员工\n\n　　周 敏（女） 资阳市公安局交通警察支队员工\n\n　　蒋皓宇 成都文理学院文法学院青年志愿者分队\n\n　　副队长\n\n　　刘恩杰 资阳市寿乡有爱党校志愿者服务团队志愿者\n\n　　阿坝州\n\n　　微 玛 阿坝州红原县红十字会志愿者\n\n　　容中木初（女）阿坝师范学院教师教育学院志愿服务队志愿者\n\n　　唐程晨 阿坝州茂县青年志愿者协会志愿者\n\n　　任兴云 阿坝州西部计划志愿者\n\n　　甘孜州\n\n　　王力之 四川大学华西医院甘孜医院（甘孜藏族自治州人民医院）康巴眼科中心眼科医生\n\n　　王杏丰 甘孜州西部计划志愿者\n\n　　姚和清 甘孜州岳扎坝村志愿者服务队队员\n\n　　拥忠次姆（女）甘孜州道孚县青年志愿者协会志愿者\n\n　　凉山州\n\n　　杜基拉姆（女） 凉山州雅砻江镇妇联主席\n\n　　吉力阿体 凉山州喜德县光明镇彝欣社区书记\n\n　　王 虹（女） 凉山州越城镇团委书记\n\n　　吴俊伟 凉山州冕宁县青年志愿者协会志愿者\n\n　　教育厅\n\n　　申 洋 川护壤巴拉健康服务志愿队队员（省卫生健康委同时推荐）\n\n　　王亚男（女） 四川电力职业技术学院青年志愿者协会指导老师\n\n　　民政厅\n\n　　左洪荣 乐山市蓝丝带助学协会会长\n\n　　周 莲（女） 内江市隆昌市“金喇叭”志愿服务队队长\n\n　　生态环境厅\n\n　　谢 敏（女） 成都市妇联垃圾分类巾帼志愿服务总队队长\n\n　　省卫生健康委\n\n　　黄晓会（女） 四川省医学科学院·四川省人民医院小丑医生志愿者团队负责人\n\n　　省国资委\n\n　　李小兵 国网成都市双流供电公司彭镇供电所九江服\n\n　　务站站长\n\n　　刘凤鸣 中国四川援外医疗队志愿者\n\n　　省乡村振兴局\n\n　　刘世喜 四川省扶贫基金会健康扶贫志愿者\n\n　　省总工会\n\n　　张 黎（女） 德阳市什邡市妇联兼职副主席\n\n　　团省委\n\n　　佘旭玮 四川体育职业学院团委书记\n\n　　省妇联\n\n　　龙 琼（女） 国家二级心理咨询师\n\n　　省文联\n\n　　冯家妹（女） 四川省文艺志愿者协会志愿者\n\n　　罗 蓉（女） 中国文艺志愿者协会志愿者\n\n　　省红十字会\n\n　　杨成永 广元市剑阁县帮帮我志愿者协会会长\n\n　　彭 锦（女） 四川省红十字成都爱心乐园志愿服务大队志愿者', '川观新闻', 251, 1);
INSERT INTO `t_inform_info` VALUES (10, '宁波：修订后的《宁波市志愿服务条例》表决通过', '2022-11-27', '　　志愿服务是现代社会文明进步的重要标志，目前，宁波全市有214万名注册志愿者、1.4万个志愿服务组织，23个单位和个人被评为全国志愿服务“四个100”先进典型。\n\n　　昨日下午，市十五届人大常委会第四十次会议表决通过了修订后的《宁波市志愿服务条例》，进一步将宁波好的做法固化下来，体现出鲜明的宁波特色。\n\n　　A 倡导“微志愿”，营造人人可为的氛围\n\n　　为进一步规范志愿者注册和保障志愿者个人权益，《条例》明确志愿者的注册方式、内容以及志愿者个人隐私的保障等内容。\n\n　　《条例》第十一条规定，志愿者可以自行或者通过志愿服务组织、志愿服务团队，在统一的志愿服务数字化系统进行注册。志愿者提供的个人基本信息应当真实、准确、完整。\n\n　　志愿服务组织、志愿服务团队应当为志愿者提供注册服务。未经志愿者本人同意，不得公开或者向第三方提供志愿者个人信息。\n\n　　为进一步固化宁波的特色做法，鼓励和支持全民参与志愿服务，《条例》第二十六条结合我市实际，“鼓励各类组织和个人就近、就便开展‘随手志愿’服务，倡导‘微志愿’服务活动，营造志愿服务人人可为、时时可为、处处可为的良好志愿服务氛围”。\n\n　　B 明确志愿服务范围，更便于工作开展\n\n　　为进一步完善和规范志愿服务活动相关内容，《条例》第十五条明确了志愿服务的范围。\n\n　　《条例》规定，“提倡在教育、科技、文化旅游、卫生健康、体育、交通、社会保障、环境保护、城市管理、司法等领域，以及在应对突发事件、大型活动中开展志愿服务活动；提倡为残疾人、未成年人、老年人、失业人员和其他有困难需要帮助的个人和家庭提供志愿服务”，更加便于志愿服务工作的开展。\n\n　　《条例》第十八条则对利用志愿服务进行营利性、非法活动等禁止行为作了规定，“不得强行指派志愿者、志愿服务组织、志愿服务团队提供志愿服务”，进一步保障志愿服务相关主体的合法权益。\n\n　　C 加大优待志愿者力度，鼓励提供优惠待遇\n\n　　《条例》对志愿服务组织、志愿服务团队参与志愿服务活动购买相关保险作了规定。第三十五条规定，在全市统一的志愿服务数字化系统注册的志愿者，参加该系统发布的志愿服务岗位或者活动时，本市为其提供人身意外伤害等保险。\n\n　　志愿服务组织安排志愿者参与可能发生人身危险的志愿服务活动时，应当为志愿者提供人身意外伤害等保险。此外，《条例》进一步加大志愿者的优待力度，在第三十九条增加了“鼓励国家机关、人民团体、群众团体、企业事业单位和其他组织为志愿者提供便利和优惠待遇”，并明确志愿服务组织、志愿服务团队或者志愿服务需求方可以对志愿者因从事志愿服务活动而支出的必要交通、误餐等费用，给予适当补贴。\n\n　　D 志愿服务助力我市共同富裕先行市建设\n\n　　《条例》也进一步体现了志愿服务助力我市共同富裕先行市的建设。\n\n　　其中第二十五条规定，本市推进城乡志愿服务协同发展，培育壮大乡村志愿服务力量。鼓励和支持城区志愿服务组织、志愿服务团队赴乡村开展志愿服务，推动志愿服务融入乡村振兴，促进共同富裕。并明确市和区县（市）人民政府及有关部门应当按照规定，通过政府购买服务等方式，支持扶贫、济困、扶老、救孤、助残、助医、助学、应急救援、生态环境等领域的志愿服务活动。\n', '宁波晚报', 2477, 1);

-- ----------------------------
-- Table structure for t_join_info
-- ----------------------------
DROP TABLE IF EXISTS `t_join_info`;
CREATE TABLE `t_join_info`  (
  `JOIN_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键id',
  `JOIN_STATUS` tinyint(255) NOT NULL DEFAULT 0 COMMENT '志愿活动的完成状态（0-未完成 1-已完成）',
  `FK_JOIN_ACTIVITY` int(255) NOT NULL COMMENT '某个志愿活动的id',
  `FK_JOIN_VOLUNTEER` int(255) NOT NULL COMMENT '参加活动的志愿者id',
  PRIMARY KEY (`JOIN_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '志愿者成功参加志愿活动的信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_join_info
-- ----------------------------
INSERT INTO `t_join_info` VALUES (1, 1, 1, 9);

-- ----------------------------
-- Table structure for t_message_info
-- ----------------------------
DROP TABLE IF EXISTS `t_message_info`;
CREATE TABLE `t_message_info`  (
  `MESSAGE_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '消息id',
  `MESSAGE_TITLE` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '消息标题',
  `MESSAGE_CONTENT` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '消息内容',
  `MESSAGE_STATUS` tinyint(4) NOT NULL DEFAULT 0 COMMENT '消息状态（0-未读 1-已读）',
  `MESSAGE_TIME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '消息发送时间',
  `MESSAGE_TYPE` tinyint(4) NOT NULL COMMENT '消息类型（0-审核通知 1-审核结果通知 2-系统消息）',
  `FK_MESSAGE_SENDER` int(11) NOT NULL COMMENT '消息发送者',
  `FK_MESSAGE_SENDERTYPE` int(11) NOT NULL COMMENT '消息发送方类型',
  `FK_MESSAGE_ACCEPTER` int(11) NULL DEFAULT NULL COMMENT '消息接收者',
  `FK_MESSAGE_ACCEPTERTYPE` int(11) NULL DEFAULT NULL COMMENT '消息接收方类型',
  PRIMARY KEY (`MESSAGE_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 22 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '用户消息信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_message_info
-- ----------------------------
INSERT INTO `t_message_info` VALUES (1, '志愿活动发布审核通知', '有新的志愿活动申请发布，请尽快前往审核，志愿活动名为深入各自包抓街道、巷道及小区,开展“牛皮癣”清理志愿服务活动', 1, '2022-08-19 16:29:04', 0, 2, 2, 1, 3);
INSERT INTO `t_message_info` VALUES (2, '申请发布活动审核结果通知', '恭喜您，申请发布的志愿活动深入各自包抓街道、巷道及小区,开展“牛皮癣”清理志愿服务活动已经成功通过审核，请前往您的个人信息 > 我的活动进行查看！', 1, '2022-08-19 16:55:14', 1, 1, 3, 2, 2);
INSERT INTO `t_message_info` VALUES (3, '申请参加活动审核通知', '有志愿者正在申请参加志愿活动，请尽快前往审核，申请参加的志愿活动为深入各自包抓街道、巷道及小区,开展“牛皮癣”清理志愿服务活动', 1, '2022-08-19 19:37:24', 0, 9, 0, 2, 2);
INSERT INTO `t_message_info` VALUES (4, '申请参加活动审核结果通知', '恭喜您，申请参加的志愿活动深入各自包抓街道、巷道及小区,开展“牛皮癣”清理志愿服务活动已成功通过审核，请前往您的个人信息 > 我的活动进行查看，希望您能准时并按要求参与本次志愿活动，合作愉快！', 1, '2022-08-19 19:40:27', 1, 2, 2, 9, 0);
INSERT INTO `t_message_info` VALUES (5, '申请加入团队审核通知', '有志愿者正在申请加入我们团队，请尽快前往审核，志愿者用户名为夜雨声烦', 1, '2022-08-19 20:32:50', 0, 9, 0, 3, 1);
INSERT INTO `t_message_info` VALUES (6, '申请加入团队审核结果通知', '很遗憾，我们已经收到您想加入我们团队的申请，并感受到了您的强烈意愿，但您暂不符合我们团队的要求，还望继续努力。', 1, '2022-08-19 20:34:50', 1, 3, 1, 9, 0);
INSERT INTO `t_message_info` VALUES (7, '申请加入团队审核通知', '有志愿者正在申请加入我们团队，请尽快前往审核，志愿者用户名为夜雨声烦', 1, '2022-08-19 20:37:01', 0, 9, 0, 2, 1);
INSERT INTO `t_message_info` VALUES (8, '申请加入团队审核结果通知', '恭喜您，已经成功申请加入我们团队，可前往您的个人信息 > 团队信息查看我们团队的详情，希望一起努力，为志愿服务事业献出自己的一份绵薄之力。', 1, '2022-08-19 20:38:03', 1, 2, 1, 9, 0);
INSERT INTO `t_message_info` VALUES (10, '志愿者团队注册审核通知', '有新的志愿者团队用户申请注册，请尽快前往审核，志愿者团队名为隆昌人民医院志愿服务中心', 1, '2022-08-25 16:20:13', 0, 12, 1, 1, 3);
INSERT INTO `t_message_info` VALUES (11, '发布系统消息', '发布系统消息测试', 1, '2022-08-25 19:20:26', 2, 1, 3, NULL, NULL);
INSERT INTO `t_message_info` VALUES (12, '申请加入团队审核通知', '有志愿者正在申请加入我们团队，请尽快前往审核，5天后将自动审核不通过，志愿者用户名为夜雨声烦', 1, '2022-09-27 22:03:52', 0, 9, 0, 2, 1);
INSERT INTO `t_message_info` VALUES (13, '志愿活动发布审核通知', '有新的志愿活动申请发布，请尽快前往审核，志愿活动名为讲好广州故事，助力红色精彩', 1, '2022-09-27 22:10:25', 0, 2, 2, 1, 3);
INSERT INTO `t_message_info` VALUES (14, '志愿活动发布审核通知', '有新的志愿活动申请发布，请尽快前往审核，志愿活动名为县政府办志愿者去永丰花园A区开展全员核酸志愿服务', 1, '2022-09-27 22:12:26', 0, 2, 2, 1, 3);
INSERT INTO `t_message_info` VALUES (15, '志愿活动发布审核通知', '有新的志愿活动申请发布，请尽快前往审核，志愿活动名为党校联系村四寨村核酸检测志愿服务', 0, '2022-09-27 22:29:07', 0, 10, 2, 1, 3);
INSERT INTO `t_message_info` VALUES (16, '志愿活动发布审核通知', '有新的志愿活动申请发布，请尽快前往审核，志愿活动名为 法律普及', 0, '2022-09-27 22:32:27', 0, 10, 2, 1, 3);
INSERT INTO `t_message_info` VALUES (17, '申请发布活动审核结果通知', '恭喜您，申请发布的志愿活动 法律普及已经成功通过审核，请前往您的个人信息 > 我的活动进行查看！', 0, '2022-09-27 22:33:17', 1, 1, 3, 10, 2);
INSERT INTO `t_message_info` VALUES (18, '申请发布活动审核结果通知', '恭喜您，申请发布的志愿活动党校联系村四寨村核酸检测志愿服务已经成功通过审核，请前往您的个人信息 > 我的活动进行查看！', 0, '2022-09-27 22:33:22', 1, 1, 3, 10, 2);
INSERT INTO `t_message_info` VALUES (19, '志愿活动发布审核通知', '有新的志愿活动申请发布，请尽快前往审核，志愿活动名为9月28日网络欺凌项目活动协助', 0, '2022-09-27 22:36:49', 0, 2, 2, 1, 3);
INSERT INTO `t_message_info` VALUES (20, '申请发布活动审核结果通知', '恭喜您，申请发布的志愿活动9月28日网络欺凌项目活动协助已经成功通过审核，请前往您的个人信息 > 我的活动进行查看！', 1, '2022-09-28 13:24:41', 1, 1, 3, 2, 2);
INSERT INTO `t_message_info` VALUES (21, '申请加入团队审核结果通知', '恭喜您，已经成功申请加入我们团队，可前往您的个人信息 > 团队信息查看我们团队的详情，希望一起努力，为志愿服务事业献出自己的一份绵薄之力。', 0, '2022-09-28 13:25:48', 1, 2, 1, 9, 0);

-- ----------------------------
-- Table structure for t_star_info
-- ----------------------------
DROP TABLE IF EXISTS `t_star_info`;
CREATE TABLE `t_star_info`  (
  `STAR_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '收藏信息id',
  `FK_STAR_ACTIVITY` int(255) NOT NULL COMMENT '被收藏的志愿活动id',
  `FK_STAR_VOLUNTEER` int(255) NOT NULL COMMENT '收藏的志愿者id',
  PRIMARY KEY (`STAR_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '志愿活动被收藏的信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_star_info
-- ----------------------------
INSERT INTO `t_star_info` VALUES (2, 1, 9);
INSERT INTO `t_star_info` VALUES (3, 6, 9);

-- ----------------------------
-- Table structure for t_team_info
-- ----------------------------
DROP TABLE IF EXISTS `t_team_info`;
CREATE TABLE `t_team_info`  (
  `TEAM_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '志愿者团队id（注册获取）',
  `TEAM_NAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队名（注册获取）',
  `TEAM_EMAIL` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队邮箱（注册获取）',
  `TEAM_PHONE` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '志愿者团队固定电话（注册获取）',
  `TEAM_PASSWORD` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队密码（注册获取）',
  `TEAM_ADDRESS` varchar(150) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队地址（注册获取）',
  `TEAM_SIMPLE` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '志愿者团队简介',
  `TEAM_AVATAR` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队头像（注册获取）',
  `TEAM_PROVE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队证明（图片地址）（注册获取）',
  `TEAM_OBJECT` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队服务对象（注册获取）',
  `TEAM_CLASSIC` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队类型（注册获取）',
  `TEAM_REGISTER` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队注册时间（注册时后端赋予）',
  `TEAM_HEAD_NAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队负责人姓名（注册获取）',
  `TEAM_HEAD_EMAIL` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队负责人邮箱（注册获取）',
  `TEAM_HEAD_PHONE` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队负责人手机（注册获取）',
  `TEAM_HEAD_IDENTITY` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队负责人证件号（注册获取）',
  `TEAM_HEAD_PICTURE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者团队负责人证件照（图片地址，注册获取）',
  `TEAM_HOURS` int(11) NOT NULL DEFAULT 0 COMMENT '志愿者团队志愿总时长',
  `TEAM_ACTIVECOUNT` int(11) NOT NULL DEFAULT 0 COMMENT '志愿者团队成员参与的志愿活动总数量',
  `TEAM_COUNT` int(11) NOT NULL DEFAULT 0 COMMENT '志愿者团队志愿者数量',
  `TEAM_TYPE` tinyint(4) NOT NULL DEFAULT 1 COMMENT '用户类型标识',
  `TEAM_STATUS` tinyint(4) NOT NULL DEFAULT 0 COMMENT '管理员决定志愿者团队账号是否启用（0-不启用 1-启用）',
  PRIMARY KEY (`TEAM_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 13 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '志愿者团队信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_team_info
-- ----------------------------
INSERT INTO `t_team_info` VALUES (1, '双益社区1志愿服务队之冯志国爱心团队阳光分队', '11456452@qq.com', '49289030', '12345', '辽宁省鞍山市立山区新立街', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '老年人,青少年,孤寡老人,农村居民', '党政机关', '2022-01-10', '庞雨', '125756675@qq.com', '14503080983', '519056545474363576', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (2, '黔东南苗族侗族自治州凯里市碧波镇又诗村村民委员会团队', '11289589@qq.com', '4363225423', '12345', '贵州省黔东南苗族侗族自治州凯里市', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '老年人,青少年,孤寡老人,农村居民', '居民/村民委员会', '2022-07-26', '甘均兰', '892898392@qq.com', '14894589343', '431848938942234355', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 72, 3, 1, 1, 1);
INSERT INTO `t_team_info` VALUES (3, '蓬溪县发改志愿服务团队', '18932898423@qq.com', '23848235', '12345', '四川省遂宁市蓬溪县政通街', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '老年人,青少年,残障人士,婴幼儿', '科技事业单位', '2021-03-14', '陈果', '138940394@qq.com', '18349553437', '513443292891523435', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (4, '东咀村志愿服务团队', '1252452323@qq.com', '426435234123', '12345', '山西省大同市云州区', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '农村居民,青少年,病患者,农村居民', '文化事业单位', '2022-07-26', '杨潮', '13409403@qq.com', '12984990349', '534215930453454622', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (5, '白水县乡村振兴服务中心志愿服务团队', '123049342@qq.com', '9823857252', '12345', '陕西省渭南市白水县新兴街', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '城镇居民,贫困家庭', '卫生事业单位', '2022-07-26', '杨斌', '153423422@qq.com', '1346352323', '873254563523141343', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (6, '党留庄罗庄村青年志愿服务团队', '13783952232@qq.com', '2358983', '12345', '山西省大同市云州区', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '其他,社会公众', '教育事业单位', '2021-04-05', '高宝', '149834353@qq.com', '13984393872', '323598059534457543', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (7, '泸州市江阳生态环境局志愿团队', '123534532@qq.com', '5425353', '12345', '四川省泸州市江阳区学院西路', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '孤寡老人,优抚对象,特殊群体', '社会团体', '2021-04-17', '朱虹颖', '119893234@qq.com', '14892858234', '519450390452323498', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (8, '宝兴县新时代文明实践中心党员志愿服务团队', '13984345@qq.com', '89823523', '12345', '四川省雅安市宝兴县兴盛街1号', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '贫困家庭,其他', '文化事业单位', '2022-01-10', '李威', '183874568@qq.com', '14883948490', '519904850394854525', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (9, '理县总工会志愿服务团队', '342334234@qq.com', '43253453430', '12345', '四川省阿坝藏族羌族自治州理县西大街65', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '老年人,妇女,青少年,贫困家庭', '社会福利事业单位', '2022-07-25', '陈鑫', '143984555@qq.com', '14583984380', '519456363452342763', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (10, '太和街道办事处志愿者服务团队', '135254235@qq.com', '5245346452345', '12345', '四川省遂宁市射洪市紫云路6号', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '优抚对象,病患者', '其他', '2022-03-10', '王玥', '1648564647@qq.com', '13467907873', '519746374786438980', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (11, '半坡店乡桃花洞村志愿服务队', '28368@qq.com', '18783989123', '12345', '河南省开封市祥符区', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '孤寡老人,老年人,残障人士,贫困家庭', '文化事业单位', '2022-07-31', '张春尧', '147889738@qq.com', '17788613663', '473927493749473952', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', 0, 0, 0, 1, 1);
INSERT INTO `t_team_info` VALUES (12, '隆昌人民医院志愿服务中心', '14858559@qq.com', '034-84223', '12345', '四川省内江市隆昌市', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '儿童,妇女,老年人,残障人士,病患者', '卫生事业单位', '2022-08-25', 'asuka', '72388949@qq.com', '17788613663', '274839573836583729', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/20220825161846.png', 0, 0, 0, 1, 1);

-- ----------------------------
-- Table structure for t_unit_info
-- ----------------------------
DROP TABLE IF EXISTS `t_unit_info`;
CREATE TABLE `t_unit_info`  (
  `UNIT_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '志愿服务单位id（注册获取）',
  `UNIT_NAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位名（注册获取）',
  `UNIT_EMAIL` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位邮箱（注册获取）',
  `UNIT_PHONE` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '志愿服务单位固定电话（注册获取）',
  `UNIT_PASSWORD` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位密码（注册获取）',
  `UNIT_ADDRESS` varchar(150) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位地址（注册获取）',
  `UNIT_SIMPLE` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '志愿服务单位简介（注册获取）',
  `UNIT_AVATAR` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位头像（由注册时后端给予默认头像地址）',
  `UNIT_PROVE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位证明（图片地址，注册获取）',
  `UNIT_CLASSIC` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位类型（注册获取）',
  `UNIT_HEAD_NAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位负责人姓名（注册获取）',
  `UNIT_HEAD_PHONE` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位负责人手机（注册获取）',
  `UNIT_HEAD_EMAIL` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位负责人邮箱（注册获取）',
  `UNIT_HEAD_IDENTITY` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位负责人证件号（注册获取）',
  `UNIT_HEAD_PICTURE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位证件照（图片地址）（注册获取）',
  `UNIT_REGISTER` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿服务单位注册时间（注册获取）',
  `UNIT_PUBLICCOUNT` int(11) NOT NULL DEFAULT 0 COMMENT '志愿服务单位已发布的志愿活动数量',
  `UNIT_TYPE` tinyint(4) NOT NULL DEFAULT 2 COMMENT '用户类型标识',
  `UNIT_STATUS` tinyint(4) NOT NULL DEFAULT 0 COMMENT '管理员决定是否启用该账号（0-不启用 1-启用）',
  PRIMARY KEY (`UNIT_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 11 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '志愿单位信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_unit_info
-- ----------------------------
INSERT INTO `t_unit_info` VALUES (1, '内江市市中区XX养老院', '12345@qq.com', '8398492', '12345', '四川省内江市市中区XX街道28号', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '党政机关', '张三', '17849384789', '12345@qq.com', '513289935792354366', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2022-02-17', 0, 2, 1);
INSERT INTO `t_unit_info` VALUES (2, '金堂县阳光里社会工作服务中心', '12378443@qq.com', '14937892784', '12345', '四川省成都市金堂县AA街道18号', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '社会团体', '蔡永国', '18982129773', '124759@qq.com', '518918988429404567', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2022-06-13', 2, 2, 1);
INSERT INTO `t_unit_info` VALUES (3, '国网四川省电力公司特高压直流中心“特电之光”', '11456452@qq.com', '49289030', '12345', '四川省成都市武侯区新光路66号', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '教育事业单位', '蒲文旭', '14503080983', '125756675@qq.com', '519056545474363576', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2022-01-10', 0, 2, 1);
INSERT INTO `t_unit_info` VALUES (4, '羊安社工站-“志愿同心，温暖同行”志愿单位', '18569798@qq.com', '89845934', '12345', '四川省成都市邛崃市富营街', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '文化事业单位', '丁玲', '19839402784', '17864545@qq.com', '519489759275433464', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2022-04-28', 0, 2, 1);
INSERT INTO `t_unit_info` VALUES (5, '蒲江县鹤山街道社工站', '18054053@qq.com', '98387472', '12345', '四川省成都市蒲江县桫椤路上段54号', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '科技事业单位', '何泽军', '19872368592', '15674535@qq.com', '513457464574525374', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2021-09-30', 0, 2, 1);
INSERT INTO `t_unit_info` VALUES (6, '国网四川映秀湾电厂', '1872843@qq.com', '765892784', '12345', '四川省成都市都江堰市都江堰大道266号', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '居民/村民委员会', '吴林娟', '19827894733', '154345467@qq.com', '518437759363443335', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2016-06-07', 0, 2, 1);
INSERT INTO `t_unit_info` VALUES (7, '金堂县阳光里社会工作服务中心', '123784@qq.com', '14937892784', '12345', '四川省成都市金堂县AA街道18号', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '基金会', '蔡永国', '18982129773', '124759@qq.com', '518918988429404462', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2022-06-13', 0, 2, 1);
INSERT INTO `t_unit_info` VALUES (8, '都江堰市幸福街道社工站', '14385344@qq.com', '14495903849', '12345', '四川省成都市都江堰市都江堰大道235', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '社会团体', '叶恒', '13983049044', '19839243@qq.com', '514834942039257892', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2022-04-12', 0, 2, 1);
INSERT INTO `t_unit_info` VALUES (9, '成都公益慈善联合会', '129843945@qq.com', '76235487', '12345', '四川省成都市成华区一环路东3段-64号-附15', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '其他', '张勇', '13985729323', '11872352344@qq.com', '513434262647823453', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2014-06-09', 0, 2, 1);
INSERT INTO `t_unit_info` VALUES (10, '天府新区青少年志愿者队', '1984539403@qq.com', '48783843', '12345', '四川省成都市金堂县AA街道18号', NULL, 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar1.jpg', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/prove.png', '社会福利事业单位', '蒲雪梅', '18287832434', '148274322@qq.com', '518772838235423567', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/identitycard.png', '2017-11-21', 2, 2, 1);

-- ----------------------------
-- Table structure for t_volunteers_info
-- ----------------------------
DROP TABLE IF EXISTS `t_volunteers_info`;
CREATE TABLE `t_volunteers_info`  (
  `VOLUNTEERS_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT '志愿者id（注册时获取）',
  `VOLUNTEERS_USERNAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者用户名（注册时获取）',
  `VOLUNTEERS_EMAIL` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者邮箱（注册时获取）',
  `VOLUNTEERS_PHONE` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者手机号（注册时获取）',
  `VOLUNTEERS_PASSWORD` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者密码（注册时获取）',
  `VOLUNTEERS_POLITICAL` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者政治面貌（注册时获取）',
  `VOLUNTEERS_PROFESSIONAL` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者从业情况（注册时获取）',
  `VOLUNTEERS_ISAPPLYTEAM` tinyint(1) NOT NULL DEFAULT 0 COMMENT '标识该志愿者是否正在申请一个志愿者团队',
  `VOLUNTEERS_STATUS` tinyint(4) NOT NULL DEFAULT 1 COMMENT '志愿者账号状态（由管理员决定是否启用该账号 1-启用 0-不启用）',
  `VOLUNTEERS_DEGREE` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者学历（注册时填写）',
  `VOLUNTEERS_ADDRESS` varchar(150) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者联系地址（注册时获取）',
  `VOLUNTEERS_PROVINCE` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者所属省份（注册时解析获得）',
  `VOLUNTEERS_AVATAR` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '志愿者头像地址（注册时后端给予默认头像地址）',
  `VOLUNTEERS_REGISTER` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '注册时间（注册时后端赋予）',
  `VOLUNTEERS_BIRTH` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '志愿者年龄（实名认证获取）',
  `VOLUNTEERS_SIMPLE` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '志愿者个人简介（自愿填写）',
  `VOLUNTEERS_NAME` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '志愿者姓名（实名认证获取）',
  `VOLUNTEERS_GENDER` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '志愿者性别（实名认证获取）',
  `VOLUNTEERS_NATIONAL` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '志愿者民族（实名认证获取）',
  `VOLUNTEERS_NATIVE` varchar(150) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '志愿者籍贯（实名认证获取）',
  `VOLUNTEERS_CARD` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '志愿者身份证号（实名认证获取）',
  `VOLUNTEERS_HOURS` int(11) NOT NULL DEFAULT 0 COMMENT '志愿时长（所有申请的志愿活动时长之和）',
  `VOLUNTEERS_ACTIVECOUNT` int(11) NOT NULL DEFAULT 0 COMMENT '志愿者参与的志愿活动数量',
  `VOLUNTEERS_BREAK` int(11) NOT NULL DEFAULT 0 COMMENT '违约次数（申请志愿活动违约次数）',
  `VOLUNTEERS_TYPE` tinyint(4) NOT NULL DEFAULT 0 COMMENT '用户类型标识（用于区别用户类型）',
  `FK_VOLUNTEERS_TEAM` int(11) NULL DEFAULT NULL COMMENT '志愿者所属志愿者团队（加入志愿者团队获取）',
  PRIMARY KEY (`VOLUNTEERS_ID`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 11 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '志愿者信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of t_volunteers_info
-- ----------------------------
INSERT INTO `t_volunteers_info` VALUES (2, '李四', '21345@qq.com', '13578204278', '12345', '群众', '工人', 0, 1, '高中(职高/中专/技校)', '四川省成都市双流区BB村2号', '四川', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar.jpg', '2022-02-12', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, NULL);
INSERT INTO `t_volunteers_info` VALUES (3, '王五', '167545@qq.com', '15938348594', '12345', '共青团员', '学生', 0, 1, '本科', '四川省成都市武侯区CC街道32号', '四川', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar.jpg', '2022-02-15', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 4, 0, NULL);
INSERT INTO `t_volunteers_info` VALUES (4, '赵六', '238793@qq.com', '18823950934', '12345', '中共党员', '国家公务员', 0, 1, '硕士研究生', '四川省南充市区DD街道124号', '四川', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar.jpg', '2022-02-23', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 3, 0, NULL);
INSERT INTO `t_volunteers_info` VALUES (5, '刘七', '13848929@qq.com', '13298530278', '12345', '群众', '专业技术人员', 0, 1, '本科', '四川省成都市温江区EE街道123号', '四川', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar.jpg', '2022-02-23', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, NULL);
INSERT INTO `t_volunteers_info` VALUES (6, 'Ayanami', '1328732@qq.com', '14887479023', '12345', '中共党员', '自由职业者', 0, 1, '博士研究生', '四川省成都市锦江区FF街道145号', '四川', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar.jpg', '2022-03-28', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 6, 0, NULL);
INSERT INTO `t_volunteers_info` VALUES (7, 'Asuka', '189234@qq.com', '14398540934', '12345', '共青团员', '学生', 0, 1, '硕士研究生', '四川省成都市成华区GG街道159号', '四川', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar.jpg', '2022-04-04', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 2, 0, NULL);
INSERT INTO `t_volunteers_info` VALUES (8, 'ikun', '3423552@qq.com', '13465357376', '12345', '群众', '职员', 0, 0, '高中', '四川省遂宁市XX区HH街道23号', '四川', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar.jpg', '2022-04-18', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, NULL);
INSERT INTO `t_volunteers_info` VALUES (9, '夜雨声烦', '18352129@qq.com', '17288231663', '12345', '共青团员', '学生', 0, 1, '硕士研究生', '四川省内江市市中区II街道43号XX村', '四川', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/20220812172227.jpg', '2022-05-13', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 72, 3, 0, 0, 2);
INSERT INTO `t_volunteers_info` VALUES (10, '沐雨橙风', '1265636@qq.com', '13465490432', '12345', '民主党派', '个体经营者', 0, 1, '初中', '四川省宜宾市翠屏区JJ街道232号', '四川', 'https://rainvex-1305747533.cos.ap-chengdu.myqcloud.com/GraduationDesign/defaultAvatar.jpg', '2022-05-24', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, NULL);

SET FOREIGN_KEY_CHECKS = 1;
